tutorials/heatTransfer/buoyantBoussinesqSimpleFoam/hotRoom/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    floor
    {
        type            buoyantPressure;
        rho             rhok;
        value           uniform 0;
    }

    ceiling
    {
        type            buoyantPressure;
        rho             rhok;
        value           uniform 0;
    }

    fixedWalls
    {
        type            buoyantPressure;
        rho             rhok;
        value           uniform 0;
    }
}

// ************************************************************************* //
